package com.pos.sdkdemo.test;

/**
 * Created by Administrator on 2016/10/24.
 */

public class PrintContents
{

	public static String Elemo = "****#1饿了么外卖订单****\n\n        卡萨披萨       \n\n       --已支付--      \n\n" +
			"      预计19:00送达     \n\n[时间]:2014-12-03 16:21\n\n  不吃辣 辣一点 多加米\n\n " +
			"[发票]这是一个发票抬头\n\n------------------------\n\n菜名          数量  " +
			"小计\n\n--------1号篮子---------\n\n测试美食一        X4   4\n\n" +
			"测试美食二        X6   6\n\n测试美食三        X2   2\n\n" +
			"--------2号篮子---------\n\n" +
			"测试1             X1   1\n\n测试2             X1   1\n\n" +
			"测试3             X1  23\n\n(+)测试西式甜点   X1   1\n\n" +
			"(+)测试酸辣       X1   1\n\n--------3号篮子---------\n\n" +
			"测试菜品名字很长很长很长\n\n测试              X1   1\n\n--------其它费用--------\n\n配送费\n\n";


	public static String Baidu = "本店留存\n************************\n      百度外卖\n      [货到付款]\n" +
			"************************\n期望送达时间：立即配送\n" +
			"订单备注:送到西门,不要辣\n发票信息:百度外卖\n************************\n下单编号: 14187186911689\n下单时间: " +
			"2014-12-16 16\n************************\n" +
			"菜品名称     数量  金额\n------------------------\n" +
			"香辣面套餐     1   40.00\n素食天线汉堡   1   38.00\n香辣面套餐     1   40.00\n" +
			"素食天线汉堡   1   38.00\n香辣面         1   43.00\n" +
			"素食天线       1   34.00\n" +
			"------------------------\n" +
			"************************\n姓名:百度测试\n" +
			"地址:泰然工贸园\n电话:18665248965\n" +
			"************************\n百度测试商户\n" +
			"18665248965\n#15 百度外卖 11月09号";
	public static String str1 = "           明豪旗舰店           \n" +
			"--------------------------------\n" +
			"联 系 人: 张磊\n" +
			"联系电话: 17318013630\n" +
			"联系地址: 广东省深圳市福田区\n" +
			"订单类别: 配送订单\n" +
			"订单状态: 交易关闭\n" +
			"支付方式: 货到付款\n" +
			"--------------------------------\n";
	public static String str2 = "商品                       单价\n" +
			"测试商品20559           ￥10.00\n" +
			"                            3份\n" +
			"--------------------------------\n";
	public static String str3 = "订单金额：              ￥30.00\n" +
			"--------------------------------\n" +
			"订 单 号:  20903551587995254784\n" +
			"下单时间:  2017-09-01 17:34\n";
	public static String str4 = "电话：0755-23947019\n" +
			"地址：深圳市福田\n";
	public static String str5 = "  打印级底部小票的字最多十四\n" +
			"打印机底部小票文字最多十四字\n";
}
